In [55]:
import pandas as pd
import seaborn as sns
import numpy as np

In [56]:
file = "../data/books.csv"
rd = pd.read_csv(file)
#Just to keep the columns names consistent with SQL good practices.
rd.columns = list(map(lambda x:x.lower(),rd.columns))
print(f"We have {rd.shape[0]} rows in this dataset")
rd.head()

We have 211 rows in this dataset

,title,author,genre,height,publisher
0,Fundamentals of Wavelets,"Goswami, Jaideva",signal_processing,228,Wiley
1,Data Smart,"Foreman, John",data_science,235,Wiley
2,God Created the Integers,"Hawking, Stephen",mathematics,197,Penguin
3,Superfreakonomics,"Dubner, Stephen",economics,179,HarperCollins
4,Orientalism,"Said, Edward",history,197,Penguin

## Author db

In [59]:
#Extract the author name into a series 
author_df = pd.DataFrame()
author_df["author"] = rd["author"].unique()
print(f"We have {author_df.shape[0]} authors in this dataset")
author_df[["last_name","name"]] = author_df["author"].str.split(", ",expand=True)
author_df["id_author"] = author_df.index
author_tosql = author_df.drop(columns="author")

author_tosql.head(1)

We have 130 authors in this dataset

  last_name     name  id_author
0   Goswami  Jaideva          0

In [60]:
#Generate and id column for the author
author_tosql["id_author"] = author_tosql.index
print(author_tosql.tail(4))

    last_name     name  id_author
126   Rowling      J K        126
127   Larsson    Steig        127
128    Eddins    Steve        128
129   Dickens  Charles        129

### Connect to SQL and charge the values to the database

In [61]:
#host='localhost', user='root',password='micolash12',database="bookstore"
from sqlalchemy import create_engine
#Create the database connection
engine = create_engine('mysql+pymysql://root:micolash12@localhost/bookstore')
#Use the built-in function 'to_sql' to write the dataframe to the database
author_tosql.to_sql('author', engine, if_exists='replace', index = False)

130

## Books db

In [62]:
#Copy the df to a book related to preserve the original
book_df = rd.copy()
#Add the id_author foreign key to the book
#replace all the occurences of the author for the value in the author dataframe
book_df['id_author'] = book_df['author'].map(author_df.set_index('author')['id_author'])

                      title            author              genre  height  \
0  Fundamentals of Wavelets  Goswami, Jaideva  signal_processing     228
1                Data Smart     Foreman, John       data_science     235

  publisher
0     Wiley
1     Wiley

,title,author,genre,height,publisher,id_author
0,Fundamentals of Wavelets,"Goswami, Jaideva",signal_processing,228,Wiley,0
1,Data Smart,"Foreman, John",data_science,235,Wiley,1

In [63]:
#Now drop the author dataframe for avoiding to much information
book_df = book_df.drop(columns=["author"])
book_df

,title,genre,height,publisher,id_author
0,Fundamentals of Wavelets,signal_processing,228,Wiley,0
1,Data Smart,data_science,235,Wiley,1
2,God Created the Integers,mathematics,197,Penguin,2
3,Superfreakonomics,economics,179,HarperCollins,3
4,Orientalism,history,197,Penguin,4
...,...,...,...,...,...
206,Structure and Randomness,mathematics,252,NaN,21
207,Image Processing with MATLAB,signal_processing,241,NaN,128
208,Animal Farm,fiction,180,NaN,80
209,"Idiot, The",fiction,197,NaN,58
210,"Christmas Carol, A",fiction,196,NaN,129

In [64]:
#host='localhost', user='root',password='micolash12',database="bookstore"
from sqlalchemy import create_engine
#Create the database connection
engine = create_engine('mysql+pymysql://root:micolash12@localhost/bookstore')
#Use the built-in function 'to_sql' to write the dataframe to the database
book_df.to_sql('book', engine, if_exists='replace', index = True) #Review this line, the index is just numerical.

211